# Value Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EvaluatedParameter..::..Value Property
EvaluatedParameter Class See Also
---
Evaluated value of the parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ParameterValue Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As ParameterValue
	Get
```

Visual C++
---
```text
public:
property ParameterValue^ Value {
	ParameterValue^ get ();
}
```

# See Also
EvaluatedParameter Class
Autodesk.Revit.DB Namespace